{"meta":{"title":"HuiProgramer","subtitle":"优秀是一种习惯，坚持是一种品格！","description":null,"author":"HuiProgramer","url":"http://HuiProgramer.github.io"},"pages":[{"title":"404-对不起！您访问的页面不存在","date":"2018-12-12T09:36:05.980Z","updated":"2018-12-12T09:36:05.980Z","comments":false,"path":"/404.html","permalink":"http://HuiProgramer.github.io//404.html","excerpt":"","text":"请点击以下链接继续浏览网页: &gt; 返回上一页面&gt; 返回网站首页"},{"title":"about","date":"2018-12-09T13:00:09.000Z","updated":"2018-12-09T14:15:12.148Z","comments":true,"path":"about/index.html","permalink":"http://HuiProgramer.github.io/about/index.html","excerpt":"","text":""},{"title":"分类","date":"2018-12-09T12:58:13.000Z","updated":"2018-12-10T09:38:43.328Z","comments":false,"path":"categories/index.html","permalink":"http://HuiProgramer.github.io/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2018-12-09T12:59:59.000Z","updated":"2018-12-10T09:38:43.448Z","comments":false,"path":"tags/index.html","permalink":"http://HuiProgramer.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"长难句分析（基本结构的长难句）","slug":"长难句分析（基本结构的长难句）","date":"2018-12-15T12:58:51.000Z","updated":"2018-12-15T13:03:30.115Z","comments":true,"path":"2018/12/15/长难句分析（基本结构的长难句）/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/15/长难句分析（基本结构的长难句）/","excerpt":"","text":"一、基本结构的长难句 断开 简化 基本结构的长难句 &emsp;长难句&emsp;多个句子/多件事&emsp;简单句&emsp;一个句子/一件&emsp;简单句的核心&nbsp;一件事的核心内容断开1 标点&emsp;2 连接词&emsp;&emsp;3 分析主谓简化1 定位谓语动词2 去修饰找核心基本结构的长难句：1. 断开（1）标点（2）连接词：从句开始于连接词，结束于？（3）分析主谓&emsp;1) 标点&emsp;2) 下一个连接词前&emsp;3) 第二个谓语动词前连接词断开，结束于标点But this is a real-life argument before a Superme Court that has a well-earned reputation for looking out for the interests of large corporations.(CET-6,201312 仔细阅读 2)If it has to hire a caregiver for every two children,it can’t really achieve any economics of scale on labor to save money when other expenses go up.(CET-4,201412 仔细阅读 1)More than half of all recent graduates are unemployed or in jobs that do not require a degree, and the amount of student-loan debt carried by households has increased more than five times since 1999.(CET-4,201312 长篇阅读)Imagine the number of teaching jobs that might be eliminated if this could be done for math,economics,chemistry,and so on.(CET-6,201406 长篇阅读)Although it has been nearly 30 years since the first commercial mobile-phone network was launched, advertisers have yet to figure out how to get their messages out to mobile-phone users in a big way.(CET-4,201312 选词填空)连接词断开，结束于第二个谓语动词前Those who stay on for an additional two years can earn a master’s degree that qualifies them as nurse practitioners or clinical nurse spercialists.(CET-4,201312 选词填空)People who score on personality tests as more sympathetic cry more than those who are more rigid or have more self-control.(CET-4,201406 长篇阅读)Though the United States has fewer women in the workforce, American women who choose to be employed are far more likely to work full-time and to hold high-level jobs as managers or professionals.(CET-6,201406 长篇阅读)断开：分析主谓This is the best movie I have seen.The present he gave me was very amazing.Some scientists maintain that the changes we are seeing fall within the range of random variation…(CET-4,201406 选词填空)Some scientists maintain thatthe changes we are seeing fall within the range of random variation…(CET-4,201406 选词填空)When these students encounter a new problem of the same type on a test, they’re able to transfer the knowledge they’ve gathered more effectively than those who were the passive recipients of someone else’s expertise.(CET-6,201312 仔细阅读 1) 二、简化：去修饰，留核心修饰成分有：形容词、副词介词短语非谓语动词(doing/done/to do)冠词、数词非限定性定语从句Over the past few months it has been working hard, with the help of media consultants, to play down its cosy reputation in favour of something more academic and serious(CET-6,201412 仔细阅读 2)Printing with moveable type on paper dramatically reduced the cost of producing a book compared with the old-fashioned ones handwritten on vellum, which comes from sheepskin.(CET-4,201406 长篇阅读)A generation ago, female faces were rare and, even today, visitors walking through the first floor of LeConte Hall will see a full corridor of exhibits honoring the many distinguished physicists who made history here,virtually all of them white males.(CET-4,201312 选词填空) 基本结构的长难句：断开 + 简化The same dramatic technological changes that have provided marketers with more communications choices have also increased the risk that passionate consumers will voice their opinions in quicker, more visible, and much more damaging ways.The same dramatic technological changes 1 have also increased the risk 2. that have provided marketers with more communications choices. that passionate consumers will voice their opinions in quicker, more visible, and much more damaging ways.","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"特殊用途的句子(虚拟句)","slug":"特殊用途的句子-虚拟句","date":"2018-12-14T14:44:35.000Z","updated":"2018-12-15T13:00:47.598Z","comments":true,"path":"2018/12/14/特殊用途的句子-虚拟句/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/14/特殊用途的句子-虚拟句/","excerpt":"","text":"第三章 虚拟1. 什么是虚拟？2. 怎么表示虚拟？3. 虚拟常用于？1. If 虚拟条件句（虚拟语气）&emsp;（1）虚拟条件句（假设现在） &emsp; If 从句 主句 假设过去 &emsp; would 假设现在 did(were) could/should&emsp;&emsp; + do 假设将来 &emsp; might If I were you, I would do it now. 练习：I am not you, so I can’t make the decision.I don’t know his phone number, so I won’t ring him up.He isn’t free at the moment, so he won’t go to the cinema. 补充：If I could rearrange the alphabet, I would put U and I together. &emsp;（2）虚拟条件句（假设过去） &emsp; If 从句 主句 假设过去 had done would + have done 假设现在 &emsp; could/should 假设将来 &emsp; might If they had won the match, they would have held a party to celebrate. 练习：He was not a student, so he couldn’t attend the lecture.He didn’t tell her the answer. She didn’t understand it.You were late, so you didn’t hear what he told us. &emsp; （3）虚拟语气（假设将来） &emsp; If 从句 主句 假设过去 &emsp; would 假设现在 &emsp; could/should 假设将来 did(were)were to doshould do might + do If I were to live my life over again, I would have you as my life. 练习：如果我明天有时间，我就会帮他。（明天不太可能有时间）If I had time tomorrow（were to have/should have）,I would help him. 总结： &emsp; If 从句 主句 假设过去 had done would + have done 假设现在 did(were) could/should + do 假设将来 did(were)were to doshould do might + do If 非真实条件句（混合时态的虚拟） &emsp; If 从句 主句 假设过去 &emsp; &emsp; 假设现在 &emsp; &emsp; 假设将来 &emsp; &emsp; 如果你（过去）嫁给他，你（现在）就会是一个加油站服务员的妻子。If you had married him, you would be the wife of a gas station attendant. 省略 If 的虚拟条件句If you had joined us, we would have had more fun.If I were you, I would think it twice. 2. 名词性从句的虚拟语气：表示“建议，要求，命令”动词后的宾语从句虚拟从句中用（should）+ doHe suggested that the system should be changed.suggest, advise, propose, recommend, order, ask, demand, insist, require, request…… 练习：宾语从句的虚拟语气 The engineers proposed they (look) at the design again. He insisted that she (send) her sister to a dancing school. The workers demanded they (give) the wages they should get. He ordered they (start) the attack before dawn. The teacher always suggests the students (go) over the text before the best. the professor recommended we (look) for the information in the library. 总结：表示 “建议，要求，命令” 的名词性从句He suggested that the system should be changed.His suggestion was that the system should be changed.He gave the suggestion that the system should be changed.This year,it was suggested that the system should be changed.","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"特殊用途的句子(倒装句)","slug":"特殊用途的句子-倒装句","date":"2018-12-13T14:15:08.000Z","updated":"2018-12-13T14:17:58.610Z","comments":true,"path":"2018/12/13/特殊用途的句子-倒装句/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/13/特殊用途的句子-倒装句/","excerpt":"","text":"第二章 倒装全部倒装/部分倒装1. 全部倒装：In the mountain lies a castle.Here comes the bus.全部倒装：There be 句型1. There be + n. “有”（客观存在）There is a girl.2. There be + n + 介词短语 “有…在哪里”（客观存在）There is a book on the table.There is no gap between mind and matter.注意：1）be 动词的变化&emsp;&emsp;&emsp;&emsp;&nbsp; There will now be a seven-day wait for jobseeker’s allowance.&emsp;&emsp;&emsp;2）主语的单复数&emsp;&emsp;&emsp;3）There 还可以与情态动词搭配&emsp;&emsp;&emsp;&emsp;&nbsp; There may be more matches in the database.2. 部分倒装：相当于把陈述句变成疑问句三种情况需要倒装（1）否定词位于句首&emsp;not, no, never, hardly, little, scarcely, seldom, not until, not only……（2）only 位于句首（3）虚拟if条件句举例：The poor man had not only been arrested but he had been sent to prison as well.Not only had the poor man been arrested, but he had been sent to prison as well.We can learn English well only in this way.Only in this way can we learn English well.练习：1. You will never know the truth.Never .2. He cares little for my words.Little .3. I had no sooner got the invitation than I refused.No sooner .4. He had hardly had time to settle down when he left the country.Hardly .5. He achieved his goal only by working hard.Only by working hard .6. Natural disasters will reduce, only when we solve the problems of environmental pollution.Only when .","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"特殊用途的句子(强调句)","slug":"特殊用途的句子-强调句","date":"2018-12-12T09:37:35.000Z","updated":"2018-12-12T09:51:39.056Z","comments":true,"path":"2018/12/12/特殊用途的句子-强调句/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/12/特殊用途的句子-强调句/","excerpt":"","text":"第一章 强调强调句It is ….. that …..I want to go to America this summer.It is America that I want to go to this summer.补充：强调过去时态：It was …. that …强调人时：It is …. that/who …练习：It is they. not American, who have become anti-intellectual.It is they who have become anti-intellectual.It is … that …写作：Lisa likes cooking at home.We used to have meetings in the cafe.They celebrated the holiday on Nov.11th.Students don’t like too much homework.Men can solve the problems of natural disaster only by controlling the environmental pollution.注意：一个句子的动词和形容词不能强调。","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的补充(复合句/状语从句)","slug":"简单句的补充-复合句-状语从句","date":"2018-12-10T14:10:39.000Z","updated":"2018-12-10T14:12:27.473Z","comments":true,"path":"2018/12/10/简单句的补充-复合句-状语从句/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/10/简单句的补充-复合句-状语从句/","excerpt":"","text":"第三章 状语从句1.状语从句的含义：一个句子作状语，表达描述性的信息。2.状语从句的写法：从属连词 + 完整的陈述句从属连词时间状语从句when, while, as, before, after, since, untilas soon as, no sooner…than地点状语从句where原因状语从句because, since, as结果状语从句so/such…that, so that…目的状语从句so that…,in order that条件状语从句if, unless, as long as让步状语从句although, though, even though, as比较状语从句than, as 方式状语从句as地点状语从句Stay where you are.Where there is a will, there is a way.结果状语从句The problem is so complicated that we cannot solve it.It is such a complicated problem that we cannot solve it.让步状语从句Although it is summer, it is very cold.It is summer, but it is very cold.比较状语从句I am as tall as you.I am as tall as you(are).方式状语从句Do it as I told you yesterday.When in Rome, do as Romans do.3.状语从句的时态：时间/条件状语从句中表示将来，要换成一般现在时。如果明天下雨，我们就不去公园。If it rains tomorrow, we will not go for a picnic.I will let him know, when he comes home later.改错练习：1. The boss will review your work after she will return from vacation next week.(returns)2. I’ll give you a call on my cell phone as soon as my plane will land .(lands)3. I don’t like my current job, but I’m going to stay with this company until I will find something better.(find)4. If it won’t be cold tomorrow. we’ll go to the beach.(isn’t)5. If it will be cold tomorrow, we will go to a movie.(is)4.状语从句的位置：If it rains tomorrow, we will not go to the park.We will not go to the park, If it rains tomorrow.We, If it rains tomorrow, will not go to the park.练习：1. He speaks English well indeed, but of course not _ a native speaker.A. as fluent as &emsp;&emsp;&emsp;&emsp;B. more fluent thanC. as fluently as &nbsp;&emsp;&emsp;&emsp;D. much fluently than2. The couple had no sooner got to the station _ the coach left.A. when &emsp;&emsp;B. as &emsp;&emsp;C. until &emsp;&emsp;D. than3. My parents don’t mind what job I do _ I am happy.A. even though &emsp;B. as soon as &emsp;C. as long as &emsp;D. as though4. The medicine works more effectively _ you drink some hot water after taking it.A. as &emsp;&amp;emspB. until &emsp;&emsp;C. although &emsp;&emsp;D. if5. __ the police thought he was the most likely one, since they had no exact proof about it,they could not arrest him.A. Although &emsp;B. As long as &emsp;C. If only &emsp;D. As soon as6. It just isn’t fair. __ I was working as a waiter last month, my friends were lying on the beach.A. whenever &emsp;B. though &emsp;C. for &emsp;D. while7. Shall we have our picnic tomorrow?_ it doesn’t rain.A.Until &emsp;&emsp;B. While &emsp;&emsp;C. Once &emsp;&emsp;D. If8. The Great Wall is _ tourist attraction that millions of people pour in every year.A. so a well-known &emsp;&emsp;&emsp;B. a so well-knownC. such well-known a &emsp;&emsp;D. such a well-known9. Owen wouldn’t eat anything _ he cooked it himself.A. until &emsp;&emsp;B. since &emsp;&emsp;C. unless &emsp;&emsp;D. while答案1.C 2.D 3.C 4.D 5.A 6.D 7.D 8.D 9.C","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的补充(复合句/定语从句)","slug":"简单句的补充-复合句-定语从句","date":"2018-12-07T14:33:54.000Z","updated":"2018-12-10T08:25:02.792Z","comments":true,"path":"2018/12/07/简单句的补充-复合句-定语从句/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/07/简单句的补充-复合句-定语从句/","excerpt":"","text":"第二章 定语从句1. 定语从句的含义：一个句子作定语，去修饰限定名词。2. 定语从句的写法：先把主句和从句写出两个句子，再把从句合并进去修饰限定名词。This is the 我梦想很多年的 job.This is the job. I have dream of the job for years.This is the job Which I have dreamed of for years.&emsp;&emsp;&emsp;&emsp;&emsp;↓&emsp;&emsp;&emsp;↓&emsp;&emsp;先行词 关系词&emsp;&emsp;关系词如何选择？&emsp;&emsp;&emsp;&emsp;看先行词！&emsp;先行词 = ？物人人的/物的时间地点原因 &emsp;关系词 = ？which/thatwho/whom/thatwhosewhenwherewhy练习关系词的选择：1. I have a class begins at 8:00 am.2. The lawyer my brother called didn’t answer the phone.3. My daughter asked me a question I couldn’t answer.4. The people sat in the stadium cheered for the home team.5. Leo is the student bike was stolen.6. Australia is one of the few countries people drive on the left.7. Sunday is the day people usually don’t go to work.8. Is there any particular reason you can’t come?答案1. which/that 2. 不填/whom/that 3. 不填/that/which 4. who 5. whose 6. where 7. when 8. why 练习写定语从句 1. I lost the book .&emsp;我弄丢了上周从图书馆借的书。2. The woman was feeding pigeons.&emsp;我在公园看见的那位女士正在喂鸽子。3. The bus is usually very crowed.&emsp;我每天上学坐的那辆公交车总是很拥挤。答案1. which/that/不填 I borrowed from the library 2. who/that/whom/不填 I saw in the park 3. which/that/不填 I take every day to school 3. 定语从句的分类： I met your friend who is staying in Paris.&emsp;&emsp;&emsp;&emsp;限定性定语从句I met your mother,who is staying in Paris.&emsp;&emsp;&emsp;&nbsp;非限定性定语从句This is the wall which they built last week.This is the Great Wall, which is world-famous.练习（填入逗号和关系词）:1. He came from Beijing is the capital of China.(,which)2. He came from a city is in the north of China.(which/that)3. This is the businessman we are cooperating with.(who/whom/that/不填)4. This is Bill Gates many people know as the richest amn.(,whom)注意：非限定性定语从句不仅可以修饰前面的名词，还可以修饰前面的整句话。The company will get back to you in three days,which is one of the typical rules.补充：介词提前的定语从句This is the job which/that/X I have dreamed of for years.This is the job of which I have dreamed of for years.Humans have the ability to modify the environment in which they live.The theory on which it is based may be right.","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的补充(复合句/名词性从句)","slug":"简单句的补充-复合句-名词性从句","date":"2018-12-06T14:15:41.000Z","updated":"2018-12-10T08:25:12.446Z","comments":true,"path":"2018/12/06/简单句的补充-复合句-名词性从句/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/06/简单句的补充-复合句-名词性从句/","excerpt":"","text":"第一章 名词性从句一、宾语从句1. 宾语从句的含义：一个句子作宾语，放在另一个句子（主句）里。2. 宾语从句的写法：&emsp;① 陈述句变成宾语从句？You are right.&emsp;&emsp;&emsp;&emsp;↓&emsp;&emsp;&emsp;&emsp;&emsp;I know __.I know (that) you are right.&emsp;② 特殊疑问句变成宾语从句？What will she say?&emsp;&emsp;&emsp;&emsp;↓&emsp;&emsp;&emsp;I know _.I know what she will say.&emsp;③ 一般疑问句变成宾语从句？Is he happy?&emsp;&emsp;&emsp;&emsp;↓&emsp;&emsp;&emsp;&emsp;&emsp;I know __.I know whether/if he is happy.总结：宾语从句的写法____ + ___&emsp;&emsp;(词 + 陈述句)练习：填入宾语从句的连接词1. 我承诺我会帮助你。&emsp;I promise I will help you.2. 你从来没告诉过我，你对我电脑做了什么。&emsp;You never told me you had done to my computer.3. 我想知道什么时候我们将会出发。&emsp;I wonder we will set out.4. 他们不知道他们是否会按时完成工作。&emsp;They don’t know they will finish the work on time.5. 你能告诉我什么时候我们将会出发吗？&emsp; Can you tell me ?答案1. that 2. what 3. when 4. whether 5. when we’ll set out3.宾语从句的位置：名词性从句：6. we know *.7. The big news is *.8. * is big news.9. We know the big news *.宾语从句：1. I don’t know when you will finish the work.No one tells me when you will finish the work. 2. I worry about whether I hurt her feelings.3. Are you positive (that) you’ve never seen that man before.二、表语从句My concern is that people don’t care about others.The question remains whether people will buy it.三、同位语从句一个句子作同位语，解释说明 n.位置：需要解释的抽象 n.后。(fact, idea, news, dream, suggestion, advice, report …)最常用的是：“that+陈述句”这种 (注意： that不作成分，但不能省略)我不怀疑他将会帮我的忙。I have no doubt that he will help me.我支持这种论据, 校车问题必须被严肃对待。I support the argument that the problems of school buses must be taken seriously.四、主语从句我们是否将会去露营取决于天气。位置1：句首Whether we will go camping depends on the weather.位置2：句尾(句首用形式主语it)It depends on the weather whether we will go camping.注意：两种位置，意思相同。但更常用的是位于句尾的主语从句。练习： 填入连接词， 并判断是哪种名词性从句。1. ____ Barbara Jones offers to her fans is honesty and happiness. A. Which &emsp;&emsp;B. What &emsp;&emsp;C. That &emsp;&emsp;D. Whom 2. We’ve offered her the job, but I don’t know ___ she’ll accept it. A. where &emsp;&emsp;B. what &emsp;&emsp;C. whether &emsp;&emsp;D. which 3. Our teachers always tell us to believe in __ we do and who we are if we want to succeed. A. why &emsp;&emsp;B. how &emsp;&emsp;C. what &emsp;&emsp;D. which 4. Modern science has given clear evidence ___ smoking can lead to many diseases. A. what &emsp;&emsp;B. which &emsp;&emsp;C. that &emsp;&emsp;D. where 5. It was never clear ____ the man hadn’t reported the accident sooner. A. that &emsp;&emsp;B. how &emsp;&emsp;C. when &emsp;&emsp;D. why 6. It is still under discussion ___ the old bus station should be replaced with a modern hotel or not. A. whether &emsp;&emsp;B. when &emsp;&emsp;C. which &emsp;&emsp;D. where 7. I am afraid he’s more of a talker than a doer, which is ___ he never finishes anything. A. that &emsp;&emsp;B. when &emsp;&emsp;C. where &emsp;&emsp;D. why 8. These wild flowers are so special that I would do __ I can to save them. A. whatever &emsp;&emsp;B. which &emsp;&emsp;C. that &emsp;&emsp;D. whichever答案1. B 主语从句 &emsp; 2. C 宾语从句 &emsp; 3. C 宾语从句 &emsp; 4. C 同位语从句 5. D 主语从句 &emsp; 6. A 主语从句 &emsp; 7. D 表语从句 &emsp; 8. A 宾语从句","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的补充(并列句)","slug":"简单句的补充-并列句","date":"2018-12-05T13:53:28.000Z","updated":"2018-12-10T08:24:53.130Z","comments":true,"path":"2018/12/05/简单句的补充-并列句/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/05/简单句的补充-并列句/","excerpt":"","text":"一、并列句的构成多件事（多个简单句）之间同等重要，用并列连词连接起来。四六级常用的并列连词有：1）&emsp;&emsp;&emsp;表示顺接：…and…;both…and…;not only…,but…as well/but also…2）&emsp;&emsp;&emsp;表示转折：but;yet;while3）&emsp;&emsp;&emsp;表示选择：…or…;either…or…;neither…nor…4）&emsp;&emsp;&emsp;表示因果：…for…（原因）;…so…（结果）二、并列句的省略I am a teacher and I like English.I am a teacher and like English.I am lying in bed and I am reading a book.I am lying in bed and reading a book.I want to leave and I want to go abroad.I want to leave and to go abroad.and(平行结构)练习1. You can stay at home go out to play. It doesn’t matter.A.either,or&emsp;&emsp;B.neither,nor&emsp;&emsp;C.both,and&emsp;&emsp;D.not only,but also2. We bought her a birthday present,_ she likes it very much.A.so&emsp;&emsp;&emsp;B.or&emsp;&emsp;&emsp;C.and&emsp;&emsp;&emsp;D.but3. _ you _ he is able to ski,but I am.A.both,and&emsp;&emsp;B.either,or&emsp;&emsp;C.neither,nor&emsp;&emsp;D.between,and4. The doctor tried their best to save the patient’s life,_failed.A.or&emsp;&emsp;B.so&emsp;&emsp;C.but&emsp;&emsp;D.because5. I could speak _ Japanese _ Chinese,so I had to talk with him in English.A.not only,but also&emsp;&emsp;B.both,and&emsp;&emsp;C.neither,norD.either,or6. I like pop music,but _ my father _ my mother likes it.A.both,and&emsp;&emsp;B.either,or&emsp;&emsp;C.neither,nor&emsp;&emsp;D.not only,but also7. Tom,keep away from the fire, you will get burnt.A.and&emsp;&emsp;B.so&emsp;&emsp;C.or&emsp;&emsp;D.but8. I thought we’d be late for the concert,__ we ended up getting there ahead of time.A.but&emsp;&emsp;B.or&emsp;&emsp;C.so&emsp;&emsp;D.for答案：第一题A第二题C第三题C第四题C第五题C第六题C第七题C第八题A","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的核心变化（同位语/插入语）","slug":"简单句的核心变化（同位语-插入语）","date":"2018-12-04T12:22:05.000Z","updated":"2018-12-10T08:25:50.234Z","comments":true,"path":"2018/12/04/简单句的核心变化（同位语-插入语）/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/04/简单句的核心变化（同位语-插入语）/","excerpt":"","text":"三、同位语/插入语同位语，解释说明前面名词，与名词相同，说的是一件事。My teacher,Mr. Lee,is coming to the meeting.插入语，插入的补充说明，与前后无关。My teacher,together with his colleagues,is coming to the meeting.All their lives, today’s young women have been pushed to embrace both perfection and passion to pursue science and sports,math and theater and do it all as well as they possibly can.2014.06 CET4Confronted with such facts, some Swedish activists and legislators are demanding more extreme and far-reaching measures,such as replacing male and female pronouns with neutral alternative and monitoring children more closely to correct them when they gravitate toward gendered play.2014.06 CET6","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的补充（非谓语动词）","slug":"简单句的补充（非谓语动词）","date":"2018-12-03T13:58:09.000Z","updated":"2018-12-10T08:24:42.498Z","comments":true,"path":"2018/12/03/简单句的补充（非谓语动词）/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/03/简单句的补充（非谓语动词）/","excerpt":"","text":"二、非谓语动词 非谓语动词共3种： doing 表示主动 done 表示被动 to do 表示目的Passing planes can be heard night and day.The teacher came into the classroom,holding a book in his hand.He bought a used car.The teacher came into the classroom, followed by five students.I have a lot of homework to do.I am coming to see you.练习：1. _, you need to give all you have and try your best. A. Being a winner &emsp;&emsp;&emsp;B. To be a winner C. Being a winner&emsp;&emsp;&emsp;D. Having been a winner2. _ into English, the sentence was found to have an entirely different word order. A. Translating&emsp;&emsp;&emsp;&nbsp;B. Translated C. To translate&emsp;&emsp;&emsp;D. Having translated3. Peter received a letter just now _his grandma would come to see him soon. A. said&emsp;&emsp;&emsp;&emsp;&nbsp;B. says C. saying&emsp;&emsp;&emsp;D. to say4. _ an important role in a new movie, Andy has a chance to become famous. A. Offer&emsp;&emsp;&emsp;&emsp;&nbsp;B. Offering C. Offered&emsp;&emsp;&emsp;D. To offer5. The island, __ to the mainland by a bridge,is easy to go to. A. joining&emsp;&emsp;&emsp;B. to join C. joined&emsp;&emsp;&emsp;D. having joined","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的补充(限定词/形容词/介词短语)","slug":"简单句的补充-限定词-形容词-介词短语","date":"2018-12-02T14:34:56.000Z","updated":"2018-12-10T08:25:23.493Z","comments":true,"path":"2018/12/02/简单句的补充-限定词-形容词-介词短语/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/02/简单句的补充-限定词-形容词-介词短语/","excerpt":"","text":"一、限定词/形容词/介词短语Girls play games.Girls are playing games.Lovely girls are playing games happily.Thousands of Lovely girls are playing games very happily.After class thousands of Lovely girls are playing games very happily on the playground.常见介词prep. : in on at / from to / into onto / with without / of / by / for / about其他介词 : before after / since until / during / between among / across through / against / like as","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的核心变化（主语/宾语/表语的变化）","slug":"简单句的核心变化（主语-宾语-表语的变化）","date":"2018-12-01T14:44:37.000Z","updated":"2018-12-10T08:26:07.920Z","comments":true,"path":"2018/12/01/简单句的核心变化（主语-宾语-表语的变化）/","link":"","permalink":"http://HuiProgramer.github.io/2018/12/01/简单句的核心变化（主语-宾语-表语的变化）/","excerpt":"","text":"(二)主语/宾语/表语的变化1. 名词/代词Most graduates always want a big-firm job.She is the leader of the organization.They gave us a good impression.2. doing/to doLaughing probably has great influence on health.To laugh probably has great influence on health.It probably has great influence on health to laugh.Having only a foggy view of the future is of little good.It is no use to talk about dreams without trying.We enjoy reading books in the library.The members of the board decide to vote against the new plan.Our main goal is to finish the task on time.3. 多个并列Science and technology will develop the process of society.Social science disciplines include geography, economics, political science, and psychology.That doesn’t mean sitting down and doing nothing at all.&emsp;&emsp;n. + v.名词/代词&emsp;&emsp;&emsp;&emsp;&nbsp;&nbsp;&nbsp;动词的时态doing&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&nbsp;&nbsp;动词的语态to do&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&nbsp;&nbsp;动词的情态多个并列&emsp;&emsp;&emsp;&emsp;&nbsp;&nbsp;&nbsp;&nbsp;动词的否态","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的核心变化（情态）","slug":"简单句的核心变化（情态）","date":"2018-11-30T12:47:34.000Z","updated":"2018-12-15T14:07:19.892Z","comments":true,"path":"2018/11/30/简单句的核心变化（情态）/","link":"","permalink":"http://HuiProgramer.github.io/2018/11/30/简单句的核心变化（情态）/","excerpt":"","text":"3. 情态用法： 情态动词 + 动词原型 情态动词的人称变化无 情态动词的动态变化有限 情态动词变否定/疑问 四六级常用的情态动词有： &emsp;现在时&emsp; &emsp;过去时&emsp; must 无 can could will would shall should may might must “必须” &emsp;can/could“能够，可以”&emsp;will/would“愿意/将要”may/might“可以，可能”&emsp;should“应该” 1 情态动词表示情态 We must finish the work within a week. Air pollution must be taken seriously. The government can solve the problem of water pollution. Tony could walk when he was only one year old. Will you marry me? I will travel abroad with my family. Potential buyers would cheer for lower interest rates. To some extent.expressions may influence emotions. Such bodily reaction might help moderate the work stress. Students should work hard to pass the exams. Those sick people should seek help from doctors. 2 情态动词表示推测 The details may be unknowable. Such searches must take years. The loss of patience can potentially have a damaging impact on our professional and personal wellbeing. The way of saying those things may have led to misunderstanding. Now something similar could be happening in the South Africa. 练习： In order to be a good salesclerk, you (must not/will not) be rude to a customer. This pie is very good. You (should/must)try a piece. Rice (should/must/may) have water in order to grow. Don’t be nervous. I think you (can/must) make it. I am not sure. Probably he (may/should) come later. 第一题1.must not第二题2.should第三题3.must/should第四题4.can第五题5.may","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的核心变化（语态）","slug":"简单句的核心变化（语态）","date":"2018-11-29T14:28:19.000Z","updated":"2018-12-10T08:25:56.817Z","comments":true,"path":"2018/11/29/简单句的核心变化（语态）/","link":"","permalink":"http://HuiProgramer.github.io/2018/11/29/简单句的核心变化（语态）/","excerpt":"","text":"2.语态n. + v.动词的时态动词的语态动词的情态谓语动词的变化–&gt;语态被动语态 狗吃了那个蛋糕。The dog ate the cake.?吃了那个蛋糕。—-&gt;蛋糕被吃了。狗吃了那个蛋糕。主语&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;宾语蛋糕被狗吃了。被动适用范围 1：及物动词。 2：不及物动词+介词。被动语态 be + done备注：be表示被动的时间 (把be变成对应的各种形态), 还表达主语单复数。done 表示被动的动作教师每天都打扫。Classrooms are cleaned(clean) every day.一座新的大楼去年建造的。A new building was built(build) last year.与时态相结合被动语态&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;be + done他每天被打。&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;He is beaten every day.他昨天被打了。&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;He was beaten yesterday.他明天将要被打。&emsp;&emsp;&emsp;&emsp;&emsp;He will be beaten tomorrow.他现在正在被打。&emsp;&emsp;&emsp;&emsp;&emsp;He is being beaten.(现在进行时的被动am/is/are + being done)他现在已经被打了。&emsp;&emsp;&emsp;&emsp;He has been beaten.(现在完成时的被动have/has + been done)Our morning paper is read(read) by over 200,000 people every day.Last night my favorite TV program was interrupted(interrupt) by a special news bulletin.His bike will be repaired(repair) by his grandfather tomorrow.The new machine has been used(use) in our factory for two week.与情态动词想结合被动语态&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;be + donePlanes are heard.Planes can be heard.Planes could be heard.Planes may be heard.Planes must be heard.这封信必须马上寄出。The letter must be sent immediately.天气不能被人们所控制。Weather cannot be controlled by people.","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"简单句的核心变化（时态）","slug":"简单句的核心变化（时态）","date":"2018-11-27T02:22:00.000Z","updated":"2018-12-15T13:40:07.582Z","comments":true,"path":"2018/11/27/简单句的核心变化（时态）/","link":"","permalink":"http://HuiProgramer.github.io/2018/11/27/简单句的核心变化（时态）/","excerpt":"","text":"二、简单句的核心变化(一)谓语动词的变化&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;n. + v. 动词的时态 动词的语态 动词的情态 动词的否定 1. 时态： 时态 过去 现在 将来 过去将来 一般 did/was/were do/does will/am/is/are going to + V.原型 would/were/was going to + V.原型 进行 be + doingbe + doing be + doing be + doing 完成 had + done have/has+done &emsp; &emsp; 完成进行 &emsp; have/has been + doing &emsp; &emsp; 一般过去时 Simple Past形式：V.过去式(did/was/were)用法：过去的事、过去的动作(无关现在)例子： He was a student. He liked music. She had a boyfriend. 变否定或者疑问 He was happy. He liked English. He was not happy. He did not like English. Was he happy? Did he like English? What was he? What did he like? 补充： &emsp; V.过去式 V.过去分词 look looked looked buy bought bought see saw seen eat ate eaten V.过去式&nbsp;&nbsp;&emsp;丨V.过去分词 一般过去时&nbsp;&nbsp;丨完成时&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;丨被动语态&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;丨不做谓语 一般现在时 Simple Present形式：V.原型/V.第三人称单数(do/does)You like English.He likes English. 用法： 1.现在经常性习惯性的动作We have the English class every day.He often gets up late. 2.现在的状态I am a teacher.We are in China. 3.永恒The earth is round.The earth moves around the sun.Knowledge is power.Practice makes perfect. 变否定或者疑问 He is happy. You like English. He likes English. He is not happy. You do not like English. He does not like English. Is he happy? Do you like English? Does he like English? How is he? What do you like? What does he like? 补充：与频率连用(every,once a week,twice a month,three times a …)alwaysusually,often,frequentlysometimes,occasionallyseldom,hardlynever 一般将来时 Simple Future形式：Will/am/is/are going to + V.原型用法：将来的事(现在的将来) I will make a new plan tomorrow. We are going to study abroad next year. 变否定或者疑问 He will leave. He is going to leave. He will not leave. He is not going to leave. Will he leave? Is he going to leave? What will he? What is he going to do? 过去将来时 Past Future形式：Would/was/were going to + V.原型用法：将来的事(过去的将来)I said that I would become a cook in the future.Tony finished his work,and then he would leave for London. 三种进行时 Progressive TenseAt 10 o’clock yesterday some students were taking an exam in their classrooms. We are taking about the water pollution. A great many candidates will be meeting here at this time tomorrow. 现在完成时 Present Perfect Tense形式：have/has + done用法：现在全部完成 He has left.现在部分完成 We have studied English for ten years. 过去完成时 Past Perfect Tense形式：had + done用法：过去的之前When he got there,she had left.She was not there. 完成进行时 = “完成” + “进行” =**时间的之前，强调进行的过程 角度相同 都表示 “现在的之前” 两种时态 现在完成时have/has + done 现在完成进行时have/has been + doing 强调不同 强调结果(做完与否都可以) 强调过程 例句 We have not won the match. We have been working hardfor several months. They on the program for almost one week before I joined them, and now we are still working on it as no good results so far. A.have been working;have come out B.had worked;came out C.had been working;have come out D.have worked;are coming out 显示答案答案：C","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]},{"title":"emoji指南","slug":"emoji指南","date":"2018-11-26T09:35:51.000Z","updated":"2018-12-10T08:24:34.118Z","comments":true,"path":"2018/11/26/emoji指南/","link":"","permalink":"http://HuiProgramer.github.io/2018/11/26/emoji指南/","excerpt":"","text":"Github提交表情指南emojiemoji 代码commit 说明:art: (调色板):art:改进代码结构/代码格式:zap: (闪电):racehorse: (赛马):zap:“:racehorse:提升性能:fire: (火焰):fire:移除代码或文件:bug: (bug):bug:修复 bug:ambulance: (急救车):ambulance:重要补丁:sparkles: (火花):sparkles:引入新功能:memo: (备忘录):memo:撰写文档:rocket: (火箭):rocket:部署功能:lipstick: (口红):lipstick:更新 UI 和样式文件:tada: (庆祝):tada:初次提交:white_check_mark: (白色复选框):white_check_mark:增加测试:lock: (锁):lock:修复安全问题:apple: (苹果):apple:修复 macOS 下的问题:penguin: (企鹅):penguin:修复 Linux 下的问题:checkered_flag: (旗帜):checked_flag:修复 Windows 下的问题:bookmark: (书签):bookmark:发行/版本标签:rotating_light: (警车灯):rotating_light:移除 linter 警告:construction: (施工):construction:工作进行中:green_heart: (绿心):green_heart:修复 CI 构建问题:arrow_down: (下降箭头):arrow_down:降级依赖:arrow_up: (上升箭头):arrow_up:升级依赖:construction_worker: (工人):construction_worker:添加 CI 构建系统:chart_with_upwards_trend: (上升趋势图):chart_with_upwards_trend:添加分析或跟踪代码:hammer: (锤子):hammer:重大重构:heavy_minus_sign: (减号):heavy_minus_sign:减少一个依赖:whale: (鲸鱼):whale:Docker 相关工作:heavy_plus_sign: (加号):heavy_plug_sign:增加一个依赖:wrench: (扳手):wrench:修改配置文件:globe_with_meridians: (地球):globe_with_meridians:国际化与本地化:pencil2: (铅笔):pencil2:修复 typo","categories":[{"name":"前端","slug":"前端","permalink":"http://HuiProgramer.github.io/categories/前端/"}],"tags":[{"name":"Github","slug":"Github","permalink":"http://HuiProgramer.github.io/tags/Github/"}],"keywords":[{"name":"前端","slug":"前端","permalink":"http://HuiProgramer.github.io/categories/前端/"}]},{"title":"简单句","slug":"简单句","date":"2018-11-25T08:06:50.000Z","updated":"2018-12-12T09:46:03.762Z","comments":true,"path":"2018/11/25/简单句/","link":"","permalink":"http://HuiProgramer.github.io/2018/11/25/简单句/","excerpt":"","text":"第一章：简单句的核心一、简单句的核心构成 简单句 一个句子（一件事）世界是物质的，物质是运动的 n. + v.主语 + 谓语 n. + 谓语 v. 一主一谓，谓语动词的不同决定简单句的不同构成。 例子I swim.I like English区分vt./vi.1)意思2)介词(prep.) I like English. The bride kissed the groom. Birds fly in the sky. We walked on the street yesterday. You look at me. 介宾结构 They offered me a vacant post. they offered a vacant post to me. I bought you a present. I bought a present for you. I find HongKong ??? I find HongKong very beautiful. I find HongKong a place for shopping. 我非常高兴。 I very happy. ??? I am very happy. 主系表系动词 be动词 （单独） “变得” get become turn go grow 感官动词 look sound smell taste feel “看 / 听 / 闻 / 尝 / 感觉起来…..” keep remain/seem appear For example: I ask you a question. 主谓双宾 You answer. 主谓 I love you. 主谓宾 You make my life complete. 主谓宾补 I am happy. 主系表 主语 + 谓语 + ?","categories":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}],"tags":[{"name":"English-Syntax","slug":"English-Syntax","permalink":"http://HuiProgramer.github.io/tags/English-Syntax/"}],"keywords":[{"name":"英语","slug":"英语","permalink":"http://HuiProgramer.github.io/categories/英语/"}]}]}